<template>
    <div class="app-wrapper drag">
        <top-navigation-bar :bgColor="'#fff'" />

        <div class="container text-start">
            <div>
                <div class="title">이용약관</div>
                <div>
                    이 약관은 챗챗(http://chetchat.me 이하 “챗챗”)에서 제공하는 서비스를
                    이용함에 있어 챗챗 서비스를 제공하는 서비스 제공자(이하 "제공자")와 서비스를 이용하는 분(이하 “이용자”)의 권리, 의무 및 책임사항을 규정함을
                    목적으로 합니다.
                </div>

                <div class="title">1. 정의</div>

                <div class="mb-3">본 이용약관에서 사용하는 용어의 정의는 아래와 같습니다.</div>

                <div class="ms-2">
                    <div>1 “콘텐츠”란 챗챗에서 이용하거나 제공되는 텍스트, 이미지, 동영상 및 광고, 링크를 말합니다.</div>
                    <div>
                        2 “이용자”란 챗챗에 접속하여 이 약관에 따라 챗챗이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
                    </div>
                    <div>
                        3 ‘회원’이라 함은 챗챗에 회원 등록을 한 자로서, 챗챗이 제공하는 서비스를 이용할 수 있는 자를
                        말합니다.
                    </div>
                    <div>
                        4 ‘비회원’이라 함은 회원에 가입하지 않고 챗챗이 제공하는 서비스를 이용하는 자를 말합니다. 비회원은
                        일부 서비스 이용이 제한됩니다.
                    </div>
                </div>

                <div class="title">2. 서비스 이용</div>

                <div class="ms-2">
                    <div>
                        1 이용자가 챗챗의 서비스를 이용하려면 본 이용약관에 동의해야 하고, 서비스를 이용할 경우 본
                        이용약관에 동의한 것으로 간주합니다.
                    </div>
                    <div>2 이용자가 챗챗을 이용하면서 제공한 콘텐츠에 대한 책임은 이용자에게 있습니다.</div>
                    <div>
                        3 이용자는 챗챗을 이용하면서 얻을 수 있는 콘텐츠에 대한 위험과 불편함을 이용자 본인이 부담합니다.
                    </div>
                    <div>
                        4 이용자가 챗챗을 이용하면서 얻을 수 있는 기술 결함에 대한 불편함과 손해를 이용자 본인이 부담합니다.
                    </div>
                    <div>
                        5 이용자가 작성한 콘텐츠는 설비 부족, 데이터 관리 등 챗챗의 판단하에 임의로 삭제할 수 있습니다.
                    </div>
                </div>

                <div class="title">3. 서비스 이용 제한</div>

                <div class="ms-2">
                    <div>
                        1 이용자가 불쾌하거나 유해하다고 생각될 수 있는 콘텐츠를 다른 이용자에게 제공했을 경우 챗챗의
                        판단하에 콘텐츠를 삭제하거나 회원을 이용 정지 처리할 수 있습니다.
                    </div>
                    <div>
                        2. 챗챗은 반사회적 세력의 구성원(과거에 구성원이었던 분을 포함)과 그 관계자, 당사 서비스를
                        악용하거나 제3자에게 불편을 끼치는 고객의 이용을 제한합니다.
                    </div>
    
                    <div>
                        3. 약관 등의 명시와 설명 및 개정
                        <div class="ms-3">
                            (1) 챗챗은 이 약관의 내용을 이용자가 쉽게 알 수 있도록 챗챗의 초기 화면과 내 설정에 게시합니다.
                        </div>
                        <div class="ms-3">
                            (2) 챗챗은 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」,
                            「전자문서 및 전자거래기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및
                            정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지
                            않는 범위에서 이 약관을 개정할 수 있습니다.
                        </div>
                        <div class="ms-3">
                            (3) 챗챗이 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 챗챗의 서비스
                            화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게
                            약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다.
                        </div>
                    </div>
                </div>

                <div class="title">4. 서비스의 중단</div>

                <div class="ms-2">
                    <div>
                        1. 챗챗은 서비스용 설비의 유지·보수, 고장 등 설비의 문제나 점검의 사유가 발생한 경우에 서비스 제공을
                        일시적으로 중단할 수 있습니다.
                    </div>
                    <div>
                        2. 챗챗은 제1항 이외에도 챗챗의 판단하에 임의로 서비스를 수정하거나 제공을 중단할 수 있습니다.
                    </div>
                    <div>
                        3. 챗챗은 제1 ,2항의 사유로 서비스의 제공이 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여
                        어떠한 책임도 지지 않습니다.
                    </div>
                </div>


                <div class="title">5. 회원가입</div>

                <div class="ms-2">
                    <div>
                        1. 이용자는 챗챗이 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를
                        함으로서 회원가입을 신청합니다.
                    </div>
                    <div>
                        2. 챗챗은 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 으로
                        등록합니다.
                        <div class="ms-3">
                            (1) 가입신청자가 이전에 회원자격을 상실한 적이 있는 경우
                        </div>
                        <div class="ms-3">(2) 가입에 필요한 정보를 허위로 입력하거나, 누락, 오기가 있는 경우</div>
                        <div class="ms-3">
                            (3) 회원으로 등록하는 것이 챗챗의 재정적, 기술적으로 지장이 있다고 판단되는 경우
                        </div>
                        <div class="ms-3">(4) 챗챗의 설비나 기술상의 문제로 인해 회원가입을 보류해야 하는 경우</div>
                        <div class="ms-3">(5) 챗챗이 정한 기준에 반하는 경우</div>
                        <div class="ms-3">(6) 그 외 관련 법령에 위배되는 경우</div>
                    </div>
    
                    <div>3. 회원가입계약의 성립 시기는 챗챗의 승낙이 회원에게 도달한 시점으로 합니다.</div>
                    <div>4. 챗챗이 승낙한 회원은 아이디와 비밀번호를 통해 챗챗 서비스 회원 접속이 가능합니다.</div>
                </div>


                <div class="title">6. 회원 탈퇴 및 자격 상실 등</div>

                <div class="ms-2">
                    <div>1. 회원은 챗챗에 언제든지 탈퇴를 요청할 수 있으며 챗챗은 즉시 회원 탈퇴를 처리합니다.</div>
                    <div>
                        2. 회원이 다음 각 호의 사유에 해당하는 경우, 챗챗은 회원자격을 제한 및 정지시킬 수 있습니다.
                        <div class="ms-3">(1) 이 약관 5조(회원가입) 2항에 해당되는 경우</div>
                        <div class="ms-3">(2) 중복 가입을 한 회원</div>
                        <div class="ms-3">(3) 이 약관 10조(이용자의 의무)에 해당되는 경우</div>
                    </div>
                    <div>
                        3. 챗챗이 회원 자격을 제한․정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가
                        시정되지 아니하는 경우 챗챗은 회원자격을 상실시킬 수 있습니다
                    </div>
                </div>


                <div class="title">7. 개인정보보호</div>

                <div class="ms-2">
                    <div>
                        1. 챗챗은 이용자의 개인정보 수집 시 서비스제공을 위하여 필요한 범위에서 최소한의 개인정보를
                        수집합니다.
                    </div>
                    <div>
                        2. 챗챗은 수집된 개인정보를 목적외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는
                        제3자에게 제공하는 경우에는 이용·제공단계에서 당해 이용자에게 그 목적을 고지하고 동의를 받습니다.
                        다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.
                    </div>
                    <div>3. 자세한 사항은 개인정보 처리방침을 참고할 수 있습니다.</div>
                </div>


                <div class="title">8. 제공자의 의무</div>
                <div class="ms-2">
                    1. 챗챗은 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에
                    따라 지속적이고, 안정적으로 서비스를 제공하는데 최선을 다하여야 합니다.
                </div>

                <div class="title">9. 회원의 ID 및 비밀번호에 대한 의무</div>
                <div class="ms-2">
                    <div>1. ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.</div>
                    <div>2. 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.</div>
                    <div>
                        3. 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 챗챗에
                        통보하고 챗챗의 안내가 있는 경우에는 그에 따라야 합니다.
                    </div>
                </div>

                <div class="title">10. 이용자의 의무</div>
                <div class="mb-3">이용자는 다음 행위를 하여서는 안 됩니다.</div>
                <div class="ms-2">
                    <div>1. 이용 신청 또는 변경시 허위 내용의 등록하는 행위</div>
                    <div>2. 타인의 정보 도용</div>
                    <div>3. 챗챗에 게시된 정보의 변경</div>
                    <div>4. 챗챗이 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시</div>
                    <div>5. 챗챗 기타 제3자의 저작권 등 지적재산권에 대한 침해</div>
                    <div>6. 챗챗 기타 제3자의 명예를 손상시키거나 불이익을 주는 행위</div>
                    <div>
                        7. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 챗챗에 공개, 개시 또는 관련
                        사이트를 연결(링크)하는 행위
                    </div>
                    <div>8. 회사 또는 제3자의 저작권 등 기타 권리를 침해하는 행위</div>
                    <div>
                        9. 챗챗 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스 감염
                        자료를 등록 또는 유포하는 행위
                    </div>
                    <div>10. 타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위</div>
                    <div>
                        11. 자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는
                        행위
                    </div>
                    <div>12.윤락행위를 알선하거나 음행을 매개하는 내용의 정보를 유통시키는 행위</div>
                    <div>
                        13. 수치심이나 혐오감 또는 공포심을 일으키는 말이나 음향, 글이나 화상 또는 영상을 계속하여
                        상대방에게 도달하게 하여 상대방의 일상적 생활을 방해하는 행위
                    </div>
                    <div>14. 비정상적인 방법으로 서비스를 이용, 접근하는 행위</div>
                    <div>15. 기타 불법한 행위</div>
                </div>


                <div class="title">11. 연결 몰과 피연결 몰</div>

                <div class="ms-2">
                    1. 챗챗은 하이퍼링크(예: 하이퍼링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된
                    타사와 이용자간에 행하는 거래에 대해서 보증 책임을 지지 않습니다.
                </div>


                <div class="title">12. 저작권의 귀속 및 이용제한</div>
                <div class="ms-2">
                    <div>1. 챗챗이 작성한 저작물에 대한 저작권 기타 지적 재산권은 챗챗에 귀속합니다.</div>
                    <div>
                        2. 이용자가 서비스를 이용하며 작성한 콘텐츠의 저작권은 이용자 본인에게 있으며, 해당 콘텐츠의 불법
                        행위에 대한 모든 책임은 이용자 본인에게 있습니다.
                    </div>
                </div>


                <div class="title">13. 분쟁해결</div>

                <div class="ms-2">
                    1. 챗챗과 이용자 간에 발생한 전자상거래 분쟁과 관련하여 이용자의 피해구제신청이 있는 경우에는
                    공정거래위원회 또는 시·도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.
                </div>

                <div class="title"></div>
                <div class="mb-3">이 약관은 2024. 5. 17부터 적용됩니다.</div>
            </div>
            <div style="height: 50px"></div>
        </div>

        <!-- <bottom-navigation-bar /> -->
    </div>
</template>

<script>
export default {
    name: 'TermsyPolicy',
};
</script>

<style scoped>
.drag {
    -webkit-user-select: text !important;
    -moz-user-select: text !important;
    -ms-user-select: text !important;
    -o-user-select: text !important;
    user-select: text !important;
}
.app-wrapper {
    overflow: scroll;
    height: 100vh;
    font-size: small;
}
.container {
    width: 100%;
}
.title {
    margin-top: 40px;
    margin-bottom: 6px;
    font-weight: bold;
    font-size: large;
}
.title2 {
    margin-top: 24px !important;
    font-size: small !important;
}
</style>